lianzhu779-alt/tuwei/pfc_llc.syscfg
epwm4.$name                                                      = "LLC_PRI_A";
epwm4.epwmGlobalLoad_gld                                         = true;
epwm4.epwmGlobalLoad_gldPeriod                                   = "1";
epwm4.epwmTimebase_hsClockDiv                                    = "EPWM_HSCLOCK_DIVIDER_1";
epwm4.epwmTimebase_period                                        = 549;
epwm4.epwmTimebase_periodGld                                     = true;
epwm4.epwmTimebase_counterMode                                   = "EPWM_COUNTER_MODE_UP_DOWN";
epwm4.epwmTimebase_syncOutPulseMode                              = "EPWM_SYNC_OUT_PULSE_ON_COUNTER_ZERO";
epwm4.epwmCounterCompare_cmpA                                    = 274;
epwm4.epwmCounterCompare_cmpAGld                                 = true;
epwm4.epwmActionQualifier_EPWM_AQ_OUTPUT_A_ON_TIMEBASE_UP_CMPA   = "EPWM_AQ_OUTPUT_HIGH";
epwm4.epwmActionQualifier_EPWM_AQ_OUTPUT_A_ON_TIMEBASE_DOWN_CMPA = "EPWM_AQ_OUTPUT_LOW";
epwm4.epwmDeadband_polarityFED                                   = "EPWM_DB_POLARITY_ACTIVE_LOW";
epwm4.epwmDeadband_enableRED                                     = true;
epwm4.epwmDeadband_enableFED                                     = true;
epwm4.epwmDeadband_redShadowMode                                 = true;
epwm4.epwmDeadband_fedShadowMode                                 = true;
epwm4.epwmDeadband_delayRED                                      = 50;
epwm4.epwmDeadband_delayFED                                      = 50;
epwm4.epwmDeadband_outputSwapOutB                                = true;
epwm4.epwmDeadband_outputSwapOutA                                = true;
epwm4.epwm.$assign                                               = "EPWM4";

epwm5.epwmGlobalLoad_gld                                         = true;
epwm5.epwmGlobalLoad_gldPeriod                                   = "1";
epwm5.epwmTimebase_hsClockDiv                                    = "EPWM_HSCLOCK_DIVIDER_1";
epwm5.epwmTimebase_period                                        = 549;
epwm5.epwmTimebase_periodGld                                     = true;
epwm5.epwmTimebase_counterMode                                   = "EPWM_COUNTER_MODE_UP_DOWN";
epwm5.epwmCounterCompare_cmpA                                    = 274;
epwm5.epwmCounterCompare_cmpAGld                                 = true;
epwm5.epwmActionQualifier_EPWM_AQ_OUTPUT_A_ON_TIMEBASE_UP_CMPA   = "EPWM_AQ_OUTPUT_HIGH";
epwm5.epwmActionQualifier_EPWM_AQ_OUTPUT_A_ON_TIMEBASE_DOWN_CMPA = "EPWM_AQ_OUTPUT_LOW";
epwm5.epwmDeadband_polarityFED                                   = "EPWM_DB_POLARITY_ACTIVE_LOW";
epwm5.epwmDeadband_enableRED                                     = true;
epwm5.epwmDeadband_enableFED                                     = true;
epwm5.epwmDeadband_redShadowMode                                 = true;
epwm5.epwmDeadband_fedShadowMode                                 = true;
epwm5.epwmDeadband_delayRED                                      = 50;
epwm5.epwmDeadband_delayFED                                      = 50;
epwm5.epwmDeadband_outputSwapOutB                                = true;
epwm5.epwmDeadband_outputSwapOutA                                = true;
epwm5.$name                                                      = "LLC_PRI_B";
epwm5.epwmTimebase_phaseEnable                                   = true;
epwm5.epwmTimebase_phaseShift                                    = 183;
epwm5.epwmTimebase_syncOutPulseMode                              = "EPWM_SYNC_OUT_PULSE_ON_EPWMxSYNCIN";
epwm5.epwmGlobalLoad_globalePWMLoadLink                          = "EPWM_LINK_WITH_EPWM_4";
epwm5.epwm.$assign                                               = "EPWM7";

epwm6.$name                                                      = "LLC_SEC_A";
epwm6.epwmGlobalLoad_gld                                         = true;
epwm6.epwmGlobalLoad_gldPeriod                                   = "1";
epwm6.epwmTimebase_hsClockDiv                                    = "EPWM_HSCLOCK_DIVIDER_1";
epwm6.epwmTimebase_period                                        = 549;
epwm6.epwmTimebase_periodGld                                     = true;
epwm6.epwmTimebase_counterMode                                   = "EPWM_COUNTER_MODE_UP_DOWN";
epwm6.epwmTimebase_phaseEnable                                   = true;
epwm6.epwmTimebase_counterModeAfterSync                          = "EPWM_COUNT_MODE_UP_AFTER_SYNC";
epwm6.epwmTimebase_phaseShift                                    = 549;
epwm6.epwmTimebase_syncOutPulseMode                              = "EPWM_SYNC_OUT_PULSE_ON_EPWMxSYNCIN";
epwm6.epwmCounterCompare_cmpA                                    = 192;
epwm6.epwmCounterCompare_cmpAGld                                 = true;
epwm6.epwmCounterCompare_cmpB                                    = 357;
epwm6.epwmCounterCompare_cmpBGld                                 = true;
epwm6.epwmActionQualifier_EPWM_AQ_OUTPUT_A_gld                   = true;
epwm6.epwmActionQualifier_EPWM_AQ_OUTPUT_A_shadowMode            = true;
epwm6.epwmActionQualifier_EPWM_AQ_OUTPUT_A_ON_TIMEBASE_UP_CMPA   = "EPWM_AQ_OUTPUT_LOW";
epwm6.epwmActionQualifier_EPWM_AQ_OUTPUT_A_ON_TIMEBASE_DOWN_CMPA = "EPWM_AQ_OUTPUT_HIGH";
epwm6.epwmActionQualifier_EPWM_AQ_OUTPUT_B_shadowMode            = true;
epwm6.epwmActionQualifier_EPWM_AQ_OUTPUT_B_gld                   = true;
epwm6.epwmActionQualifier_EPWM_AQ_OUTPUT_B_ON_TIMEBASE_UP_CMPB   = "EPWM_AQ_OUTPUT_HIGH";
epwm6.epwmActionQualifier_EPWM_AQ_OUTPUT_B_ON_TIMEBASE_DOWN_CMPB = "EPWM_AQ_OUTPUT_LOW";
epwm6.epwmGlobalLoad_globalePWMLoadLink                          = "EPWM_LINK_WITH_EPWM_4";
epwm6.epwm.$assign                                               = "EPWM5";
epwm6.epwm.epwm_aPin.$assign                                     = "GPIO8";
epwm6.epwm.epwm_bPin.$assign                                     = "GPIO9";

epwm7.epwmGlobalLoad_gld                                         = true;
epwm7.epwmGlobalLoad_gldPeriod                                   = "1";
epwm7.epwmTimebase_hsClockDiv                                    = "EPWM_HSCLOCK_DIVIDER_1";
epwm7.epwmTimebase_period                                        = 549;
epwm7.epwmTimebase_periodGld                                     = true;
epwm7.epwmTimebase_counterMode                                   = "EPWM_COUNTER_MODE_UP_DOWN";
epwm7.epwmTimebase_phaseEnable                                   = true;
epwm7.epwmTimebase_syncOutPulseMode                              = "EPWM_SYNC_OUT_PULSE_ON_EPWMxSYNCIN";
epwm7.epwmCounterCompare_cmpA                                    = 192;
epwm7.epwmCounterCompare_cmpAGld                                 = true;
epwm7.epwmCounterCompare_cmpB                                    = 357;
epwm7.epwmCounterCompare_cmpBGld                                 = true;
epwm7.epwmActionQualifier_EPWM_AQ_OUTPUT_A_gld                   = true;
epwm7.epwmActionQualifier_EPWM_AQ_OUTPUT_A_shadowMode            = true;
epwm7.epwmActionQualifier_EPWM_AQ_OUTPUT_A_ON_TIMEBASE_UP_CMPA   = "EPWM_AQ_OUTPUT_LOW";
epwm7.epwmActionQualifier_EPWM_AQ_OUTPUT_A_ON_TIMEBASE_DOWN_CMPA = "EPWM_AQ_OUTPUT_HIGH";
epwm7.epwmActionQualifier_EPWM_AQ_OUTPUT_B_shadowMode            = true;
epwm7.epwmActionQualifier_EPWM_AQ_OUTPUT_B_gld                   = true;
epwm7.epwmActionQualifier_EPWM_AQ_OUTPUT_B_ON_TIMEBASE_UP_CMPB   = "EPWM_AQ_OUTPUT_HIGH";
epwm7.epwmActionQualifier_EPWM_AQ_OUTPUT_B_ON_TIMEBASE_DOWN_CMPB = "EPWM_AQ_OUTPUT_LOW";
epwm7.$name                                                      = "LLC_SEC_B";
epwm7.epwmTimebase_phaseShift                                    = 366;
epwm7.epwmGlobalLoad_globalePWMLoadLink                          = "EPWM_LINK_WITH_EPWM_4";
epwm7.epwm.$assign                                               = "EPWM8";

gpio1.$name             = "LED_STATUS_RED";
gpio1.writeInitialValue = true;
gpio1.direction         = "GPIO_DIR_MODE_OUT";
gpio1.gpioPin.$assign   = "GPIO56";

gpio2.writeInitialValue = true;
gpio2.direction         = "GPIO_DIR_MODE_OUT";
gpio2.$name             = "LED_STATUS_BLUE";
gpio2.gpioPin.$assign   = "GPIO57";

