lianzhu779-alt/tuwei/pfc_llc.syscfg
gpio3.writeInitialValue = true;
gpio3.direction         = "GPIO_DIR_MODE_OUT";
gpio3.$name             = "LED_STATUS_GREEN";
gpio3.gpioPin.$assign   = "GPIO59";

gpio4.$name             = "LED_HEARTBEAT";
gpio4.writeInitialValue = true;
gpio4.direction         = "GPIO_DIR_MODE_OUT";
gpio4.initialValue      = 1;
gpio4.gpioPin.$assign   = "GPIO58";

gpio5.$name             = "SYS_FAN1_TACH";
gpio5.writeInitialValue = true;
gpio5.gpioPin.$assign   = "GPIO22_VFBSW";

gpio6.$name             = "SYS_FAN2_TACH";
gpio6.writeInitialValue = true;
gpio6.gpioPin.$assign   = "GPIO28";

gpio7.writeInitialValue = true;
gpio7.$name             = "PFC_Relay";
gpio7.direction         = "GPIO_DIR_MODE_OUT";
gpio7.initialValue      = 1;
gpio7.gpioPin.$assign   = "GPIO27";

gpio8.writeInitialValue = true;
gpio8.$name             = "SYS_FAN3_TACH";
gpio8.gpioPin.$assign   = "GPIO26";

memcfg.config_MEMCFG_SECT_LS0        = "CLA_prog";
memcfg.config_MEMCFG_SECT_LS2        = "CLA_data";
memcfg.config_MEMCFG_SECT_LS3        = "CLA_data";
memcfg.init_MEMCFG_SECT_MSGCPUTOCLA1 = true;
memcfg.init_MEMCFG_SECT_MSGCLA1TOCPU = true;
memcfg.config_MEMCFG_SECT_LS7        = "CLA_data";
memcfg.config_MEMCFG_SECT_LS1        = "CLA_prog";

sync.epwm7SyncInSource = "SYSCTL_SYNC_IN_SRC_EPWM4SYNCOUT";

/**
 * Pinmux solution for unlocked pins/peripherals. This ensures that minor changes to the automatic solver in a future
 * version of the tool will not impact the pinmux you originally saw.  These lines can be completely deleted in order to
 * re-solve from scratch.
 */
epwm1.epwm.epwm_aPin.$suggestSolution = "GPIO0";
epwm1.epwm.epwm_bPin.$suggestSolution = "GPIO1";
epwm2.epwm.epwm_aPin.$suggestSolution = "GPIO2";
epwm2.epwm.epwm_bPin.$suggestSolution = "GPIO3";
epwm3.epwm.$suggestSolution           = "EPWM3";
epwm3.epwm.epwm_aPin.$suggestSolution = "GPIO4";
epwm3.epwm.epwm_bPin.$suggestSolution = "GPIO5";
epwm4.epwm.epwm_aPin.$suggestSolution = "GPIO6";
epwm4.epwm.epwm_bPin.$suggestSolution = "GPIO7";
epwm5.epwm.epwm_aPin.$suggestSolution = "GPIO12";
epwm5.epwm.epwm_bPin.$suggestSolution = "GPIO13";
epwm7.epwm.epwm_aPin.$suggestSolution = "GPIO14";
epwm7.epwm.epwm_bPin.$suggestSolution = "GPIO15";
